'''
ДЗ 4. Переміщення елементів в списку

Ваша програма повинна перенести останній список елементів із кінця в початок,
т.е. останній елемент списку повинен стати першим. При цьому послідовність інших елементів не повинна змінюватися.

Якщо список пустий, тоді має висвітлитись пустий список, якщо тільки один елемент,
то тоді аналогічно висвітлюється список без переміщення ,
якщо елементів більше ніж 1 - має відбутись переміщення і виведення результату.
'''

lst = []#[24,12,48,10,5,90,8]
lst1 = []
x = len(lst)
if x <= 1:
    lst1 = lst.copy()
else:
    lst1 =[lst[-1]] + lst[0:-1]

print(lst1)
print(len(lst1))

